duvallee/drone_transmitter_bt_nrf51822/bt_transmitter/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_uart_over_ble_main main.c
 * @{
 * @ingroup  ble_sdk_app_nus_eval
 * @brief    UART over BLE application main file.
 *
 * This file contains the source code for a sample application that uses the Nordic UART service.
 * This application uses the @ref srvlib_conn_params module.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "nrf_delay.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_button.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "project.h"
#include "bt_transmitter_timer.h"
#include "bt_transmitter_ble_service.h"
#include "bt_transmitter_parser.h"

#if defined(SERIAL_RX_SPEKTRUM_1024)
#include "bt_transmitter_spektrum_1024.h"
#endif


// -----------------------------------------------------------------------------
// ...
#define DEVICE_NAME                                      "DRONE-BT-TRANSMITTER"                                /**< Name of device. Will be included in the advertising data. */

#define IS_SRVC_CHANGED_CHARACT_PRESENT                  0                                                     /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#define CENTRAL_LINK_COUNT                               0                                                     /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT                            1                                                     /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define NUS_SERVICE_UUID_TYPE                            BLE_UUID_TYPE_VENDOR_BEGIN                            /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_ADV_INTERVAL                                 64                                                    /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS                       180                                                   /**< The advertising timeout (in units of seconds). */

#define APP_TIMER_PRESCALER                              0                                                     /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE                          4                                                     /**< Size of timer operation queues. */

#define MIN_CONN_INTERVAL                                MSEC_TO_UNITS(20, UNIT_1_25_MS)                       /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL                                MSEC_TO_UNITS(75, UNIT_1_25_MS)                       /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                                    0                                                     /**< Slave latency. */
#define CONN_SUP_TIMEOUT                                 MSEC_TO_UNITS(4000, UNIT_10_MS)                       /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY                   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)            /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY                    APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)           /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT                     3                                                     /**< Number of attempts before giving up the connection parameter negotiation. */

#define DEAD_BEEF                                        0xDEADBEEF                                            /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define UART_TX_BUF_SIZE                                 256                                                   /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE                                 256                                                   /**< UART RX buffer size. */

static uint16_t m_conn_handle                            = BLE_CONN_HANDLE_INVALID;                            /**< Handle of the current connection. */

static ble_uuid_t m_adv_uuids[]                          = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};    /**< Universally unique service identifier. */

// -----------------------------------------------------------------------------
BT_PROJECT g_bt_Project[1]                               =
{
   {
      .system_time.milli_second                          = 0,
      .system_time.second                                = 0,
   }
};

// -----------------------------------------------------------------------------
#define BT_TRANSMITTER_APP_ERROR_CHECK(ERR_CODE)                                                   \
   do                                                                                              \
   {                                                                                               \
      const uint32_t LOCAL_ERR_CODE = (ERR_CODE);                                                  \
      if (LOCAL_ERR_CODE != NRF_SUCCESS)                                                           \
      {                                                                                            \
         NRF_LOG_PRINTF("[%s-%d] error_code : %d \r\n", __FUNCTION__, __LINE__, (int) ERR_CODE);   \
         APP_ERROR_CHECK(ERR_CODE);                                                                \
      }                                                                                            \
   } while (0)
   /* end of macro */


/* --------------------------------------------------------------------------
 * Name : send_msg_to_fc_controller
 *
 *
 * -------------------------------------------------------------------------- */
#define DELAY_TIME_BETWEEN_BYTE                          10                      // us
void send_msg_to_fc_controller(uint8_t* pdata, uint8_t bytes)
{
   uint32_t i                                            = 0;
   UNUSED_VARIABLE(i);

   for (i = 0; i < (bytes); i++)
   {
      while(app_uart_put(*(pdata + i)) != NRF_SUCCESS)
      {
         nrf_delay_us(DELAY_TIME_BETWEEN_BYTE);
      }
   }
}

/* --------------------------------------------------------------------------
 * Name : assert_nrf_callback
 *
 *          @ brief      Function for assert macro callback.
 *          @ details    This function will be called in case of an assert in the SoftDevice.
 *          @ warning    This handler is an example only and does not fit a final product. You need to analyse
 *                       how your product is supposed to react in case of Assert.
 *          @ warning    On assert from the SoftDevice, the system can only recover on reset.
 *          @ param[in]  line_num    Line number of the failing ASSERT call.
 *          @ param[in]  p_file_name File name of the failing ASSERT call.
 *
 * -------------------------------------------------------------------------- */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
#if defined(DEBUG_RTT_ERROR)
   NRF_LOG_PRINTF("[%s-%d] %d, %s \r\n", __FUNCTION__, __LINE__, line_num, p_file_name);
#endif
   app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/* --------------------------------------------------------------------------
 * Name : gap_params_init
 *
 *          @ brief      Function for the GAP initialization.
 *          @ details    This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *                       the device. It also sets the permissions and appearance.
 *
 * -------------------------------------------------------------------------- */
static void gap_params_init(void)
{
   uint32_t err_code;
   ble_gap_conn_params_t gap_conn_params;
   ble_gap_conn_sec_mode_t sec_mode;

   BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

   err_code                                              = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *) DEVICE_NAME, strlen(DEVICE_NAME));
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   memset(&gap_conn_params, 0, sizeof(gap_conn_params));

   gap_conn_params.min_conn_interval                     = MIN_CONN_INTERVAL;
   gap_conn_params.max_conn_interval                     = MAX_CONN_INTERVAL;
   gap_conn_params.slave_latency                         = SLAVE_LATENCY;
   gap_conn_params.conn_sup_timeout                      = CONN_SUP_TIMEOUT;

   err_code                                              = sd_ble_gap_ppcp_set(&gap_conn_params);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/* --------------------------------------------------------------------------
 * Name : services_init
 *
 *          @ brief      Function for initializing services that will be used by the application.
 *
 * -------------------------------------------------------------------------- */
static void services_init(void)
{
   uint32_t err_code;
   ble_nus_init_t nus_init;

   memset(&nus_init, 0, sizeof(nus_init));

