duvallee/drone_transmitter_bt_nrf51822/bt_transmitter/main.c
   nus_init.data_handler                                 = bt_transmitter_ble_data_handler;
   err_code                                              = ble_nus_init(&(g_bt_Project->ble_nordic_uart_service), &nus_init);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/* --------------------------------------------------------------------------
 * Name : on_conn_params_evt
 *
 *          @ brief      Function for handling an event from the Connection Parameters Module.
 *          @ details    This function will be called for all events in the Connection Parameters Module
 *                       which are passed to the application.
 *
 *          @ note       All this function does is to disconnect. This could have been done by simply setting
 *                       the disconnect_on_fail config parameter, but instead we use the event handler
 *                       mechanism to demonstrate its use.
 *
 *          @ param[in]  p_evt  Event received from the Connection Parameters Module.
 *
 * -------------------------------------------------------------------------- */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code                                         = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
    }
}


/* --------------------------------------------------------------------------
 * Name : conn_params_error_handler
 *
 *          @ brief      Function for handling errors from the Connection Parameters module.
 *          @ param[in]  nrf_error  Error code containing information about what went wrong.
 *
 * -------------------------------------------------------------------------- */
static void conn_params_error_handler(uint32_t nrf_error)
{
   APP_ERROR_HANDLER(nrf_error);
}


/* --------------------------------------------------------------------------
 * Name : conn_params_init
 *
 *          @ brief      Function for initializing the Connection Parameters module.
 *
 * -------------------------------------------------------------------------- */
static void conn_params_init(void)
{
   uint32_t err_code;
   ble_conn_params_init_t cp_init;

   memset(&cp_init, 0, sizeof(cp_init));

   cp_init.p_conn_params                                 = NULL;
   cp_init.first_conn_params_update_delay                = FIRST_CONN_PARAMS_UPDATE_DELAY;
   cp_init.next_conn_params_update_delay                 = NEXT_CONN_PARAMS_UPDATE_DELAY;
   cp_init.max_conn_params_update_count                  = MAX_CONN_PARAMS_UPDATE_COUNT;
   cp_init.start_on_notify_cccd_handle                   = BLE_GATT_HANDLE_INVALID;
   cp_init.disconnect_on_fail                            = false;
   cp_init.evt_handler                                   = on_conn_params_evt;
   cp_init.error_handler                                 = conn_params_error_handler;

   err_code                                              = ble_conn_params_init(&cp_init);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}

/* --------------------------------------------------------------------------
 * Name : sleep_mode_enter
 *
 *          @ brief      Function for putting the chip into sleep mode.
 *
 * -------------------------------------------------------------------------- */
static void sleep_mode_enter(void)
{
   uint32_t err_code                                     = bsp_indication_set(BSP_INDICATE_IDLE);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   // Prepare wakeup buttons.
   err_code                                              = bsp_btn_ble_sleep_mode_prepare();
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   // Go to system-off mode (this function will not return; wakeup will cause a reset).
   err_code                                              = sd_power_system_off();
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}

/* --------------------------------------------------------------------------
 * Name : on_adv_evt
 *
 *          @ brief      Function for handling advertising events.
 *          @ details    This function will be called for advertising events which are passed to the application.
 *          @ param[in]  ble_adv_evt  Advertising event.
 *
 * -------------------------------------------------------------------------- */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
   uint32_t err_code;

   switch (ble_adv_evt)
   {
      case BLE_ADV_EVT_FAST:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE_ADV_EVT_FAST : %d \r\n", __FUNCTION__, __LINE__, BLE_ADV_EVT_FAST);
#endif
         err_code                                        = bsp_indication_set(BSP_INDICATE_ADVERTISING);
         BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
         break;

      case BLE_ADV_EVT_IDLE:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE_ADV_EVT_IDLE : %d \r\n", __FUNCTION__, __LINE__, BLE_ADV_EVT_IDLE);
#endif
         sleep_mode_enter();
         break;

      default:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] default : %d \r\n", __FUNCTION__, __LINE__, ble_adv_evt);
#endif
         break;
   }
}


/* --------------------------------------------------------------------------
 * Name : on_ble_evt
 *
 *          @ brief      Function for the application's SoftDevice event handler.
 *          @ param[in]  p_ble_evt SoftDevice event.
 *
 * -------------------------------------------------------------------------- */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
   uint32_t err_code;

   switch (p_ble_evt->header.evt_id)
   {
      case BLE_GAP_EVT_CONNECTED:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE Connected !!! : %d \r\n", __FUNCTION__, __LINE__, BLE_GAP_EVT_CONNECTED);
#endif
         g_bt_Project->bt_connected                      = 1;
         break;

      case BLE_GAP_EVT_DISCONNECTED:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE Disconnected !!! : %d \r\n", __FUNCTION__, __LINE__, BLE_GAP_EVT_DISCONNECTED);
#endif
         g_bt_Project->bt_connected                      = 0;
         break;

      case BLE_GAP_EVT_CONN_PARAM_UPDATE :
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE Param Update !!! : %d \r\n", __FUNCTION__, __LINE__, BLE_GAP_EVT_CONN_PARAM_UPDATE);
#endif
         break;

      case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
         // Pairing not supported
         err_code                                        = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
         BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE BLE_GAP_EVT_SEC_PARAMS_REQUEST !!! : %d  \r\n", __FUNCTION__, __LINE__, BLE_GAP_EVT_SEC_PARAMS_REQUEST);
#endif
         break;

      case BLE_GATTS_EVT_SYS_ATTR_MISSING:
         // No system attributes have been stored.
         err_code                                        = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
         BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE_GATTS_EVT_SYS_ATTR_MISSING !!! : %d  \r\n", __FUNCTION__, __LINE__, BLE_GATTS_EVT_SYS_ATTR_MISSING);
#endif
         break;

      case BLE_GATTS_EVT_WRITE :
#if 0
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] GATTS EVT WRITE !!! : %d \r\n", __FUNCTION__, __LINE__, BLE_GATTS_EVT_WRITE);
#endif
#endif
         break;

      default:
#if 0
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] default : %d \r\n", __FUNCTION__, __LINE__, p_ble_evt->header.evt_id);
#endif
#endif
         break;
   }
}


/* --------------------------------------------------------------------------
 * Name : ble_evt_dispatch
 *
 *          @ brief      Function for dispatching a SoftDevice event to all modules with a SoftDevice
 *                       event handler
 *          @ details    This function is called from the SoftDevice event interrupt handler after a
 *                       SoftDevice event has been received.
 *          @ param[in]  p_ble_evt  SoftDevice event.
 *
 * -------------------------------------------------------------------------- */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
   ble_conn_params_on_ble_evt(p_ble_evt);
   ble_nus_on_ble_evt(&(g_bt_Project->ble_nordic_uart_service), p_ble_evt);
   on_ble_evt(p_ble_evt);
   ble_advertising_on_ble_evt(p_ble_evt);
   bsp_btn_ble_on_ble_evt(p_ble_evt);
}


/* --------------------------------------------------------------------------
 * Name : ble_stack_init
 *
 *          @ brief      Function for the SoftDevice initialization.
 *          @ details    This function initializes the SoftDevice and the BLE event interrupt.
 *
 * -------------------------------------------------------------------------- */
static void ble_stack_init(void)
{
   uint32_t err_code;

   nrf_clock_lf_cfg_t clock_lf_cfg                       = NRF_CLOCK_LFCLKSRC;

   // Initialize SoftDevice.
   SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

   ble_enable_params_t ble_enable_params;
   err_code                                              = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT, &ble_enable_params);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   //Check the ram settings against the used number of links
   CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);
   // Enable BLE stack.
   err_code                                              = softdevice_enable(&ble_enable_params);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   // Subscribe for BLE events.
   err_code                                              = softdevice_ble_evt_handler_set(ble_evt_dispatch);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/* --------------------------------------------------------------------------
 * Name : bsp_event_handler
 *
 *          @ brief      Function for handling events from the BSP module.
 *          @ param[in]  event   Event generated by button press.
 *
 * -------------------------------------------------------------------------- */
void bsp_event_handler(bsp_event_t event)
{
   uint32_t err_code;
   switch (event)
   {
      case BSP_EVENT_SLEEP :
         sleep_mode_enter();
         break;

