duvallee/drone_transmitter_bt_nrf51822/bt_transmitter/main.c
      case BSP_EVENT_DISCONNECT :
         err_code                                        = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
         if (err_code != NRF_ERROR_INVALID_STATE)
         {
            BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
         }
         break;

      case BSP_EVENT_WHITELIST_OFF :
#if defined(DEBUG_RTT_ERROR)
         NRF_LOG_PRINTF("[%s-%d] event : BSP_EVENT_WHITELIST_OFF \r\n", __FUNCTION__, __LINE__);
#endif
         err_code                                        = ble_advertising_restart_without_whitelist();
         if (err_code != NRF_ERROR_INVALID_STATE)
         {
            BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
         }
         break;

      default:
         break;
   }
}

/* --------------------------------------------------------------------------
 * Name : uart_event_handle
 *
 *          @ brief      Function for handling app_uart events.
 *          @ details    This function will receive a single character from the app_uart module and append it to
 *                       a string. The string will be be sent over BLE when the last character received was a
 *                       'new line' i.e '\n' (hex 0x0D) or if the string has reached a length of
 *          @ref         NUS_MAX_DATA_LENGTH.
 *
 * -------------------------------------------------------------------------- */
void uart_event_handle(app_uart_evt_t* p_event)
{
   static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
   static uint8_t index                                  = 0;
   uint32_t err_code                                     = 0;

   switch (p_event->evt_type)
   {
      case APP_UART_DATA_READY :
#if 1
         {
            UNUSED_VARIABLE(err_code);
            index                                        = 0;
            while (app_uart_get(&data_array[index]) == NRF_SUCCESS)
            {
               if (index >= BLE_NUS_MAX_DATA_LEN)
               {
                  break;
               }
               index++;
            }
            if (index != 0)
            {
               err_code                                  = ble_nus_string_send(&(g_bt_Project->ble_nordic_uart_service), data_array, index);
               if (err_code != NRF_ERROR_INVALID_STATE)
               {
                  BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
               }
            }
         }
#else
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&(g_bt_Project->ble_nordic_uart_service), data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }

                index = 0;
#endif
         break;

      case APP_UART_COMMUNICATION_ERROR :
         APP_ERROR_HANDLER(p_event->data.error_communication);
         break;

      case APP_UART_FIFO_ERROR :
         APP_ERROR_HANDLER(p_event->data.error_code);
         break;

      default:
         break;
   }
}


/* --------------------------------------------------------------------------
 * Name : uart_init
 *
 *          @ brief      Function for initializing the UART module.
 *
 * -------------------------------------------------------------------------- */
static void uart_init(void)
{
   uint32_t err_code                                     = 0;
   const app_uart_comm_params_t comm_params              =
   {
      RX_PIN_NUMBER,
      TX_PIN_NUMBER,
      RTS_PIN_NUMBER,
      CTS_PIN_NUMBER,
      APP_UART_FLOW_CONTROL_DISABLED,
      false,
      UART_BAUDRATE_BAUDRATE_Baud115200
   };

   APP_UART_FIFO_INIT(&comm_params, UART_RX_BUF_SIZE, UART_TX_BUF_SIZE, uart_event_handle, APP_IRQ_PRIORITY_LOW, err_code);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/* --------------------------------------------------------------------------
 * Name : advertising_init
 *
 *          @ brief      Function for initializing the Advertising functionality.
 *
 * -------------------------------------------------------------------------- */
static void advertising_init(void)
{
   uint32_t err_code;
   ble_advdata_t advdata;
   ble_advdata_t scanrsp;

   // Build advertising data struct to pass into @ref ble_advertising_init.
   memset(&advdata, 0, sizeof(advdata));
   advdata.name_type                                     = BLE_ADVDATA_FULL_NAME;
   advdata.include_appearance                            = false;
   advdata.flags                                         = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

   memset(&scanrsp, 0, sizeof(scanrsp));
   scanrsp.uuids_complete.uuid_cnt                       = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
   scanrsp.uuids_complete.p_uuids                        = m_adv_uuids;

   ble_adv_modes_config_t options                        = {0};
   options.ble_adv_fast_enabled                          = BLE_ADV_FAST_ENABLED;
   options.ble_adv_fast_interval                         = APP_ADV_INTERVAL;
   options.ble_adv_fast_timeout                          = APP_ADV_TIMEOUT_IN_SECONDS;

   err_code                                              = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/* --------------------------------------------------------------------------
 * Name : buttons_leds_init
 *
 *          @ brief      Function for initializing buttons and leds.
 *          @ param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 *
 * -------------------------------------------------------------------------- */
static void buttons_leds_init(bool * p_erase_bonds)
{
   bsp_event_t startup_event;

