duvallee/drone_transmitter_bt_nrf51822/bt_transmitter/main.c
   uint32_t err_code                                     = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), bsp_event_handler);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   err_code                                              = bsp_btn_ble_init(NULL, &startup_event);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
   *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/* --------------------------------------------------------------------------
 * Name : power_manage
 *
 *          @ brief      Function for placing the application in low power state while waiting for events.
 *
 * -------------------------------------------------------------------------- */
static void power_manage(void)
{
   uint32_t err_code                                     = sd_app_evt_wait();

#if defined(DEBUG_RTT_ERROR)
   if (err_code != NRF_SUCCESS)
   {
      NRF_LOG_PRINTF("[%s-%d] error handler : %d \r\n", __FUNCTION__, __LINE__, err_code);
   }
#endif

    BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}

/* --------------------------------------------------------------------------
 * Name : system_idle_timer
 *
 *          @ brief      idle timer
 *
 * -------------------------------------------------------------------------- */
void system_idle_timer(void* pArg)
{
//    NRF_LOG_PRINTF("[%s-%d] system running time %d.%d sec  \r\n", __FUNCTION__, __LINE__, g_bt_Project->system_time.second, g_bt_Project->system_time.milli_second);
   bt_transmitter_make_packet();
}

/* --------------------------------------------------------------------------
 * Name : main
 *
 *          @ brief      Application main function.
 *
 * -------------------------------------------------------------------------- */
int main(void)
{
   uint32_t err_code;
   bool erase_bonds;

   memset(g_bt_Project, 0, sizeof(g_bt_Project));

   // Initialize.
   APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
   APP_TIMER_DEF(bt_transmitter_timer);

   uart_init();

#if 0
   buttons_leds_init(&erase_bonds);
#else
   UNUSED_VARIABLE(erase_bonds);
   UNUSED_VARIABLE(buttons_leds_init);
#endif
   ble_stack_init();
   gap_params_init();
   services_init();
   advertising_init();
   conn_params_init();

#if defined(DEBUG_GPIO_PIN)
   nrf_gpio_cfg_output(DEBUG_GPIO_PIN);
   nrf_gpio_pin_write(DEBUG_GPIO_PIN, 0);
#endif

#if defined(DEBUG_GPIO_EXT_PIN)
   nrf_gpio_cfg_output(DEBUG_GPIO_EXT_PIN);
   nrf_gpio_pin_write(DEBUG_GPIO_EXT_PIN, 0);
#endif

   BT_TRANSMITTER_APP_ERROR_CHECK(NRF_LOG_INIT());

   err_code                                              = ble_advertising_start(BLE_ADV_MODE_FAST);
   if (err_code != NRF_SUCCESS)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] ble_advertising_start() failed : %d \r\n", __FUNCTION__, __LINE__, (int) err_code);
#endif
   }
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   if (app_timer_create(&bt_transmitter_timer, APP_TIMER_MODE_REPEATED, bt_transmitter_timer_handler) != NRF_SUCCESS)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] Can't create app timer \r\n", __FUNCTION__, __LINE__);
#endif
   }

   if (app_timer_start(bt_transmitter_timer, APP_TIMER_TICKS(1, APP_TIMER_PRESCALER), NULL) != NRF_SUCCESS)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] Can't create app timer \r\n", __FUNCTION__, __LINE__);
#endif
   }

   fc_serial_rx_init();

   add_timer(system_idle_timer, 1000, -1, (void*) NULL);

   NRF_LOG_PRINTF("=============================================================  \r\n");
   NRF_LOG_PRINTF("Drone Remote Controller Start !!!  \r\n");
   NRF_LOG_PRINTF("Build : compiled %s %s  \r\n", __DATE__, __TIME__);
   NRF_LOG_PRINTF("=============================================================  \r\n");

   // Enter main loop.
   for (;;)
   {
      power_manage();
   }
}


